/*Вводится одно натуральное число, не более 31. Напишите программу, которая делает то же самое, что и в примерах входных и выходных данных. Будьте внимательны, числа и знаки операций разделены пробелами.

Sample Input 1:

18
Sample Output 1:

18 / 16 % 2 = 1
18 / 8 % 2 = 0
18 / 4 % 2 = 0
18 / 2 % 2 = 1
18 / 1 % 2 = 0
Sample Input 2:

31
Sample Output 2:

31 / 16 % 2 = 1
31 / 8 % 2 = 1
31 / 4 % 2 = 1
31 / 2 % 2 = 1
31 / 1 % 2 = 1
Sample Input 3:

10
Sample Output 3:

10 / 16 % 2 = 0
10 / 8 % 2 = 1
10 / 4 % 2 = 0
10 / 2 % 2 = 1
10 / 1 % 2 = 0
*/

#include <iostream>
using namespace std;
int main()
{
    int x, a1, a2, a3, a4, a5;
    cin >> x;
    a1 = x / 16 % 2;
    a2 = x / 8 % 2;
    a3 = x / 4 % 2;
    a4 = x / 2 % 2;
    a5 = x % 2;
    cout << x << " / 16 % 2 = " << a1 << endl;
    cout << x << " / 8 % 2 = " << a2 << endl;
    cout << x << " / 4 % 2 = " << a3 << endl;
    cout << x << " / 2 % 2 = " << a4 << endl;
    cout << x << " / 1 % 2 = " << a5 << endl;
}